using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson3
{
    /*
    Выполнил: Юдин Д.

    а) Написать программу, которая запрашивает массу и рост человека, вычисляет его индекс массы
    и сообщает, нужно ли человеку похудеть, набрать вес или всё в норме.
    б) *Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса.

    */
    class Fractions
    {

        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу по расчету индекса массы тела");
            Console.WriteLine("Укажите ваш вес в кг:");

            Console.ReadLine();
        }
    }
}
