using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson4
{
    /*
    Задание №1.
    Выполнил: Юдин Д.

    Дан  целочисленный  массив  из 20 элементов.  
    Элементы  массива  могут принимать  целые  значения  от –10 000 до 10 000 включительно. 
    Заполнить случайными числами.  
    Написать программу, позволяющую найти и вывести количество пар элементов массива, в которых только одно число делится на 3. 
    В данной задаче под парой подразумевается два подряд идущих элемента массива. 
    Например, для массива из пяти элементов: 6; 2; 9; –3; 6 ответ — 2. 
    */
    class Array
    {
        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу ...");

            Console.ReadLine();
        }
    }
}
