using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson4
{
    /*
    Задание №4.
    Выполнил: Юдин Д.

    Решить задачу с логинами из урока 2, только логины и пароли считать из файла в массив. 
    Создайте структуру Account, содержащую Login и Password.
    */
    class Authentication
    {
        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу ...");

            Console.ReadLine();
        }
    }
}
