using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson4
{
    /*
    Задание №5.
    Выполнил: Юдин Д.

    *а) Реализовать библиотеку с классом для работы с двумерным массивом. 
    Реализовать конструктор, заполняющий массив случайными числами. 
    Создать методы, которые возвращают сумму всех элементов массива, 
    сумму всех элементов массива больше заданного, 
    свойство, возвращающее минимальный элемент массива, 
    свойство, возвращающее максимальный элемент массива, 
    метод, возвращающий номер максимального элемента массива (через параметры, используя модификатор ref или out).
    **б) Добавить конструктор и методы, которые загружают данные из файла и записывают данные в файл.
    **в) Обработать возможные исключительные ситуации при работе с файлами.
    */
    class DoubleArray
    {
        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу ...");

            Console.ReadLine();
        }
    }
}
