using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson4
{
    /*
    Задание №2.
    Выполнил: Юдин Д.

    Реализуйте задачу 1 в виде статического класса StaticClass;
    а) Класс должен содержать статический метод, который принимает на вход массив и решает задачу 1;
    б) *Добавьте статический метод для считывания массива из текстового файла. Метод должен возвращать массив целых чисел;
    в)**Добавьте обработку ситуации отсутствия файла на диске.
    */
    class StaticArray
    {
        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу ...");

            Console.ReadLine();
        }
    }
}
