using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson6
{
    /*
    Выполнил: Юдин Д.
    */

    /// <summary>
    /// **Считайте файл различными способами. Смотрите “Пример записи файла различными способами”. 
    /// Создайте методы, которые возвращают массив byte (FileStream, BufferedStream), строку для StreamReader и массив int для BinaryReader.
    /// </summary>
    class Task4
    {
        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу ...");

            Console.ReadLine();
        }
    }
}
