using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson5
{
    /*
    Выполнил: Юдин Д.

    Задание #3
    */

    /// <summary>
    /// *Для двух строк написать метод, определяющий, является ли одна строка перестановкой другой.
    /// Например:badc являются перестановкой abcd.
    /// </summary>
    class Line
    {
        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу ...");

            Console.ReadLine();
        }
    }
}
