using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson5
{
    /*
    Выполнил: Юдин Д.

    Задание #1
    */

    /// <summary>
    /// Создать программу, которая будет проверять корректность ввода логина. 
    /// Корректным логином будет строка от 2 до 10 символов, содержащая только буквы латинского алфавита или цифры, при этом цифра не может быть первой:
    /// а) без использования регулярных выражений;
    /// б) ** с использованием регулярных выражений.
    /// </summary>
    class Login
    {
        static public void start()
        {
            Console.WriteLine("Добро пожаловать в программу ...");

            Console.ReadLine();
        }
    }
}
